In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import sqlite3
con=sqlite3.connect('HR.db')
cur=con.cursor()
%load_ext sql
%sql sqlite:///HR.db

'Connected: @HR.db'

In [2]:
import prettytable
prettytable.DEFAULT='DEFAULT'

In [14]:
%%sql
CREATE TABLE employees (
    emp_id CHAR(20) PRIMARY KEY NOT NULL,
    f_name VARCHAR(50),
    l_name VARCHAR(50),
    ssn INTEGER,
    b_date DATE,
    sex CHAR(10),
    address VARCHAR(100),
    job_id INTEGER,
    salary INTEGER,
    manager_id INTEGER,
    dept_id INTEGER
);

 * sqlite:///HR.db
(sqlite3.OperationalError) table employees already exists
[SQL: CREATE TABLE employees (
    emp_id CHAR(20) PRIMARY KEY NOT NULL,
    f_name VARCHAR(50),
    l_name VARCHAR(50),
    ssn INTEGER,
    b_date DATE,
    sex CHAR(10),
    address VARCHAR(100),
    job_id INTEGER,
    salary INTEGER,
    manager_id INTEGER,
    dept_id INTEGER
);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [15]:
%%sql
INSERT INTO employees VALUES
('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2),
('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5),
('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5),
('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30004, 5),
('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2),
('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2),
('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7),
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7),
('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7),
('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30004, 5);

 * sqlite:///HR.db
10 rows affected.

[]

In [16]:
%sql select * from employees

 * sqlite:///HR.db
Done.

[('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2),
 ('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5),
 ('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5),
 ('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30004, 5),
 ('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2),
 ('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2),
 ('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7),
 ('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7),
 ('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7),
 ('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30004, 5)]

In [17]:
%%sql
CREATE TABLE job_history (
    emp_id CHAR(20) NOT NULL,
    start_date DATE NOT NULL,
    job_id INTEGER NOT NULL,
    dept_id INTEGER NOT NULL,
    PRIMARY KEY (emp_id, start_date)
);

 * sqlite:///HR.db
Done.

[]

In [18]:
%%sql
INSERT INTO job_history (emp_id, start_date, job_id, dept_id) VALUES
('E1001', '2000-01-08', 100, 2),
('E1002', '2001-01-08', 200, 5),
('E1003', '2001-08-16', 300, 5),
('E1004', '2001-08-16', 400, 5),
('E1005', '2000-05-30', 500, 2),
('E1006', '2001-08-16', 600, 2),
('E1007', '2002-05-30', 650, 7),
('E1008', '2010-06-05', 660, 7),
('E1009', '2016-08-16', 234, 7),
('E1010', '2016-08-16', 220, 5);

 * sqlite:///HR.db
10 rows affected.

[]

In [19]:
%sql select * from job_history;

 * sqlite:///HR.db
Done.

[('E1001', '2000-01-08', 100, 2),
 ('E1002', '2001-01-08', 200, 5),
 ('E1003', '2001-08-16', 300, 5),
 ('E1004', '2001-08-16', 400, 5),
 ('E1005', '2000-05-30', 500, 2),
 ('E1006', '2001-08-16', 600, 2),
 ('E1007', '2002-05-30', 650, 7),
 ('E1008', '2010-06-05', 660, 7),
 ('E1009', '2016-08-16', 234, 7),
 ('E1010', '2016-08-16', 220, 5)]

In [21]:
%%sql
CREATE TABLE jobs (
    job_id INTEGER PRIMARY KEY,
    job_title VARCHAR(50) NOT NULL,
    min_salary INTEGER NOT NULL,
    max_salary INTEGER NOT NULL
);
INSERT INTO jobs (job_id, job_title, min_salary, max_salary) VALUES
(100, 'Sr. Architect', 60000, 100000),
(200, 'Sr. Software Developer', 60000, 80000),
(300, 'Jr. Software Developer', 40000, 60000),
(400, 'Jr. Software Developer', 40000, 60000),
(500, 'Jr. Architect', 50000, 70000),
(600, 'Lead Architect', 70000, 100000),
(650, 'Jr. Designer', 60000, 70000),
(660, 'Jr. Designer', 60000, 70000),
(234, 'Sr. Designer', 70000, 90000),
(220, 'Sr. Designer', 70000, 90000);

 * sqlite:///HR.db
Done.
10 rows affected.

[]

In [22]:
%sql select * from jobs;

 * sqlite:///HR.db
Done.

[(100, 'Sr. Architect', 60000, 100000),
 (200, 'Sr. Software Developer', 60000, 80000),
 (220, 'Sr. Designer', 70000, 90000),
 (234, 'Sr. Designer', 70000, 90000),
 (300, 'Jr. Software Developer', 40000, 60000),
 (400, 'Jr. Software Developer', 40000, 60000),
 (500, 'Jr. Architect', 50000, 70000),
 (600, 'Lead Architect', 70000, 100000),
 (650, 'Jr. Designer', 60000, 70000),
 (660, 'Jr. Designer', 60000, 70000)]

In [23]:
%%sql
CREATE TABLE locations (
    location_id CHAR(10) PRIMARY KEY,
    dept_id INTEGER NOT NULL
);
INSERT INTO locations (location_id, dept_id) VALUES
('L0001', 2),
('L0002', 5),
('L0003', 7);

 * sqlite:///HR.db
Done.
3 rows affected.

[]

In [25]:
%sql select * from locations

 * sqlite:///HR.db
Done.

[('L0001', 2), ('L0002', 5), ('L0003', 7)]

In [26]:
%%sql
CREATE TABLE departments (
    dept_id INTEGER PRIMARY KEY,
    dept_name VARCHAR(50) NOT NULL,
    manager_id INTEGER NOT NULL,
    location_id CHAR(10) NOT NULL,
    FOREIGN KEY (location_id) REFERENCES locations(location_id)
);
INSERT INTO departments (dept_id, dept_name, manager_id, location_id) VALUES
(2, 'Architect Group', 30001, 'L0001'),
(5, 'Software Group', 30002, 'L0002'),
(7, 'Design Team', 30003, 'L0003');

 * sqlite:///HR.db
Done.
3 rows affected.

[]

In [27]:
%sql select * from departments;

 * sqlite:///HR.db
Done.

[(2, 'Architect Group', 30001, 'L0001'),
 (5, 'Software Group', 30002, 'L0002'),
 (7, 'Design Team', 30003, 'L0003')]

In [28]:
%sql select name from sqlite_master where type="table";

 * sqlite:///HR.db
Done.

[('employees',), ('job_history',), ('jobs',), ('locations',), ('departments',)]

In [29]:
%sql select * from employees

 * sqlite:///HR.db
Done.

[('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2),
 ('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5),
 ('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5),
 ('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30004, 5),
 ('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2),
 ('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2),
 ('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7),
 ('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7),
 ('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7),
 ('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30004, 5)]

In [30]:
%%sql
create view empinfo as select emp_id,f_name,l_name,b_date,sex,salary from employees;

 * sqlite:///HR.db
Done.

[]

In [31]:
%sql select * from empinfo

 * sqlite:///HR.db
Done.

[('E1001', 'John', 'Thomas', '1976-09-01', 'M', 100000),
 ('E1002', 'Alice', 'James', '1972-07-31', 'F', 80000),
 ('E1003', 'Steve', 'Wells', '1980-10-08', 'M', 50000),
 ('E1004', 'Santosh', 'Kumar', '1985-07-20', 'M', 60000),
 ('E1005', 'Ahmed', 'Hussain', '1981-04-01', 'M', 70000),
 ('E1006', 'Nancy', 'Allen', '1978-06-02', 'F', 90000),
 ('E1007', 'Mary', 'Thomas', '1975-05-05', 'F', 65000),
 ('E1008', 'Bharath', 'Gupta', '1985-06-05', 'M', 65000),
 ('E1009', 'Andrea', 'Jones', '1990-09-07', 'F', 70000),
 ('E1010', 'Ann', 'Jacob', '1982-03-30', 'F', 70000)]

In [32]:
%sql select * from jobs

 * sqlite:///HR.db
Done.

[(100, 'Sr. Architect', 60000, 100000),
 (200, 'Sr. Software Developer', 60000, 80000),
 (220, 'Sr. Designer', 70000, 90000),
 (234, 'Sr. Designer', 70000, 90000),
 (300, 'Jr. Software Developer', 40000, 60000),
 (400, 'Jr. Software Developer', 40000, 60000),
 (500, 'Jr. Architect', 50000, 70000),
 (600, 'Lead Architect', 70000, 100000),
 (650, 'Jr. Designer', 60000, 70000),
 (660, 'Jr. Designer', 60000, 70000)]

In [42]:
%%sql
drop view if exists empinfo;
create view empinfo as select emp_id,f_name,l_name,b_date,sex,job_title,min_salary,max_salary from employees,jobs where employees.job_id=jobs.job_id;

 * sqlite:///HR.db
Done.
Done.

[]

In [43]:
%sql select * from empinfo

 * sqlite:///HR.db
Done.

[('E1001', 'John', 'Thomas', '1976-09-01', 'M', 'Sr. Architect', 60000, 100000),
 ('E1002', 'Alice', 'James', '1972-07-31', 'F', 'Sr. Software Developer', 60000, 80000),
 ('E1003', 'Steve', 'Wells', '1980-10-08', 'M', 'Jr. Software Developer', 40000, 60000),
 ('E1004', 'Santosh', 'Kumar', '1985-07-20', 'M', 'Jr. Software Developer', 40000, 60000),
 ('E1005', 'Ahmed', 'Hussain', '1981-04-01', 'M', 'Jr. Architect', 50000, 70000),
 ('E1006', 'Nancy', 'Allen', '1978-06-02', 'F', 'Lead Architect', 70000, 100000),
 ('E1007', 'Mary', 'Thomas', '1975-05-05', 'F', 'Jr. Designer', 60000, 70000),
 ('E1008', 'Bharath', 'Gupta', '1985-06-05', 'M', 'Jr. Designer', 60000, 70000),
 ('E1009', 'Andrea', 'Jones', '1990-09-07', 'F', 'Sr. Designer', 70000, 90000),
 ('E1010', 'Ann', 'Jacob', '1982-03-30', 'F', 'Sr. Designer', 70000, 90000)]

In [44]:
%%sql
create view emp_dept as select emp_id,f_name,l_name,dept_id from employees;

 * sqlite:///HR.db
Done.

[]

In [45]:
%sql select * from emp_dept;

 * sqlite:///HR.db
Done.

[('E1001', 'John', 'Thomas', 2),
 ('E1002', 'Alice', 'James', 5),
 ('E1003', 'Steve', 'Wells', 5),
 ('E1004', 'Santosh', 'Kumar', 5),
 ('E1005', 'Ahmed', 'Hussain', 2),
 ('E1006', 'Nancy', 'Allen', 2),
 ('E1007', 'Mary', 'Thomas', 7),
 ('E1008', 'Bharath', 'Gupta', 7),
 ('E1009', 'Andrea', 'Jones', 7),
 ('E1010', 'Ann', 'Jacob', 5)]

In [49]:
%%sql
drop view if exists emp_dept;
select emp_id,f_name,l_name,dept_name from employees,departments where employees.dept_id=departments.dept_id;

 * sqlite:///HR.db
Done.
Done.

[('E1001', 'John', 'Thomas', 'Architect Group'),
 ('E1002', 'Alice', 'James', 'Software Group'),
 ('E1003', 'Steve', 'Wells', 'Software Group'),
 ('E1004', 'Santosh', 'Kumar', 'Software Group'),
 ('E1005', 'Ahmed', 'Hussain', 'Architect Group'),
 ('E1006', 'Nancy', 'Allen', 'Architect Group'),
 ('E1007', 'Mary', 'Thomas', 'Design Team'),
 ('E1008', 'Bharath', 'Gupta', 'Design Team'),
 ('E1009', 'Andrea', 'Jones', 'Design Team'),
 ('E1010', 'Ann', 'Jacob', 'Software Group')]

In [4]:
%sql select * from employees;

 * sqlite:///HR.db
Done.

[('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2),
 ('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5),
 ('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5),
 ('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30004, 5),
 ('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2),
 ('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2),
 ('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7),
 ('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7),
 ('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7),
 ('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30004, 5)]

In [3]:
%sql select name from sqlite_master where type="table";

 * sqlite:///HR.db
Done.

[('employees',), ('job_history',), ('jobs',), ('locations',), ('departments',)]

In [6]:
%%sql
select * from employees;

 * sqlite:///HR.db
Done.

[('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2),
 ('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5),
 ('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5),
 ('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30004, 5),
 ('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2),
 ('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2),
 ('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7),
 ('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7),
 ('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7),
 ('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30004, 5)]

In [7]:
%sql select * from job_history;

 * sqlite:///HR.db
Done.

[('E1001', '2000-01-08', 100, 2),
 ('E1002', '2001-01-08', 200, 5),
 ('E1003', '2001-08-16', 300, 5),
 ('E1004', '2001-08-16', 400, 5),
 ('E1005', '2000-05-30', 500, 2),
 ('E1006', '2001-08-16', 600, 2),
 ('E1007', '2002-05-30', 650, 7),
 ('E1008', '2010-06-05', 660, 7),
 ('E1009', '2016-08-16', 234, 7),
 ('E1010', '2016-08-16', 220, 5)]

In [8]:
%sql select * from jobs;

 * sqlite:///HR.db
Done.

[(100, 'Sr. Architect', 60000, 100000),
 (200, 'Sr. Software Developer', 60000, 80000),
 (220, 'Sr. Designer', 70000, 90000),
 (234, 'Sr. Designer', 70000, 90000),
 (300, 'Jr. Software Developer', 40000, 60000),
 (400, 'Jr. Software Developer', 40000, 60000),
 (500, 'Jr. Architect', 50000, 70000),
 (600, 'Lead Architect', 70000, 100000),
 (650, 'Jr. Designer', 60000, 70000),
 (660, 'Jr. Designer', 60000, 70000)]

In [9]:
%sql select * from locations;

 * sqlite:///HR.db
Done.

[('L0001', 2), ('L0002', 5), ('L0003', 7)]

In [10]:
%sql select * from departments;

 * sqlite:///HR.db
Done.

[(2, 'Architect Group', 30001, 'L0001'),
 (5, 'Software Group', 30002, 'L0002'),
 (7, 'Design Team', 30003, 'L0003')]

In [13]:
%%sql
select f_name,l_name,start_date from employees e,job_history j where e.emp_id
=j.emp_id and emp_id=5;

 * sqlite:///HR.db
(sqlite3.OperationalError) ambiguous column name: emp_id
[SQL: select f_name,l_name,start_date from employees e,job_history j where e.emp_id
=j.emp_id and emp_id=5;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)